rottenpotatoes/app/controllers/movies_controller.rb

  def find
    #debugger
    id = params[:id] # retrieve movie ID from URI route
    m = Movie.find_movies_same_director(id)
    if m[0].director.empty? or m.length == 0
---
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas' LIMIT 1
SELECT "movies".* FROM "movies"